{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true,"batch_input_shape":[null,32,28],"dtype":"float32"}},{"class_name":"GaussianNoise","config":{"stddev":0.5,"name":"gaussian_noise_GaussianNoise1","trainable":true}},{"class_name":"Dense","config":{"units":224,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"GaussianNoise","config":{"stddev":0.5,"name":"gaussian_noise_GaussianNoise2","trainable":true}},{"class_name":"Dense","config":{"units":448,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Reshape","config":{"target_shape":[16,28],"name":"reshape_Reshape1","trainable":true}}]},"keras_version":"tfjs-layers 1.5.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[896,224],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[224],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[224,448],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[448],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.1","convertedBy":null}